test/site/content-org/all-posts.org
#+hugo_base_dir: ../

#+seq_todo: TODO DRAFT DONE
#+seq_todo: TEST__TODO | TEST__DONE

#+property: header-args :eval no

#+startup: indent

#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]

# https://scripter.co/latex-in-html/
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@

#+author:

*** Headless Page Bundle Index Page
:PROPERTIES:
:EXPORT_FILE_NAME: index
:EXPORT_HUGO_HEADLESS: t
:END:
This is a *headless* page bundle. This feature was introduced in [[https://github.com/gohugoio/hugo/commit/0432c64dd22e4610302162678bb93661ba68d758][this
commit]], and available in Hugo v0.35+.

As this bundle is headless, the *index* page of this bundle (this
page!) will not be published anywhere:
- It will have no =Permalink= and no rendered HTML in =public/=.
- It will not be part of =.Site.RegularPages=, etc.

But you can get it by =.Site.GetPage ...=. Here is an example ([[https://github.com/gohugoio/hugo/issues/4311#issuecomment-359461045][ref]]):
#+begin_example
{{ $headless := .Site.GetPage "page" "some-headless-page" }}
{{ $reusablePages := $headless.Resources.Match "sidebar-content*" }}
{{ range $reusablePages }}
    {{ .Title }}
{{ end }}
#+end_example

There are many use cases of such headless page bundles:
- Shared media galleries
- Reusable page content "snippets"
